{
    /* Configuração do ambiente onde o código será executado.*/
    "env": {
      "browser": true, // Indica que o código será executado em um ambiente de navegador.
      "es2021": true   // Habilita recursos do ECMAScript 2021 (ES12).
    },
  
    /* Extensões de configuração do ESLint a serem utilizadas.*/
    "extends": [
      "eslint:recommended", // Usa as configurações recomendadas pelo ESLint.
      "plugin:react/recommended" // Usa as configurações recomendadas para projetos que utilizam React.
    ],
  
    /* Opções do parser (analisador sintático) do ESLint.*/
    "parserOptions": {
      "ecmaVersion": "latest", // Especifica a versão mais recente do ECMAScript para suporte máximo.
      "sourceType": "module" // Indica que o código utiliza o sistema de módulos (ES6 modules).
    },
  
    /* Lista de plugins adicionais do ESLint a serem utilizados.*/
    "plugins": [
      "react"  // Habilita regras específicas do React por meio do plugin "react".
    ],
  
    /* Regras personalizadas do ESLint a serem aplicadas ao código.*/
    "rules": {
        // Regra de indentação: exige que o código seja indentado com 2 espaços.
        "indent": [
          "error",  // Define o nível de severidade como "erro" caso a indentação não esteja correta.
          2  // Define a quantidade de espaços (ou tabulações equivalentes) para a indentação.
        ],
      
        // Regra de estilo de quebra de linha: exige o uso do estilo "unix" (LF) para quebras de linha.
        "linebreak-style": [
          "error",  // Define o nível de severidade como "erro" caso o estilo de quebra de linha não esteja correto.
          "unix",   // Define o estilo de quebra de linha "unix" (LF - Line Feed) como o estilo aceito.
          "windows" // Define o estilo de quebra de linha "windows" (CRLF - Carriage Return + Line Feed) como o estilo aceito no código.
        ],
      
        // Regra de estilo de aspas: exige o uso de aspas simples.
        "quotes": [
          "error",  // Define o nível de severidade como "erro" caso o estilo de aspas não esteja correto.
          "single"  // Define as aspas simples como o estilo aceito para delimitar strings.
        ],
      
        // Regra de ponto e vírgula: exige que sempre haja ponto e vírgula no final de cada declaração.
        "semi": [
          "error",  // Define o nível de severidade como "erro" caso um ponto e vírgula esteja faltando.
          "always"  // Exige a presença do ponto e vírgula após cada declaração.
        ]
      }
      
  }
  